<a href="https://colab.research.google.com/github/Arkhtor98/BIA/blob/main/SQL1_EX2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Week 5 - SQL (1/2) - Exercice 2

# National Collegiate Athletic Association | NCAA
We will now use an extract of a dataset about the NCAA, which oversees and regulates North American university sports.

College presidents across the USA recognized a need to track how student-athletes are doing academically prior to graduation. Therefore, they implemeted a comprehensive academic refore package designed to improve the academic success and graduation of all student-athletes. The centerpiece of the academic reform package was the development of a real-time academic measurement for sports teams, known as the Academic Progress Rate (APR).

The APR includes student-athlete eligibility, retention and graduation as factors in a formula that yields a single number, providing a much clearer picture of the current academic culture on each sports team. Since its inception, the APR has become an important measure of student-athlete academic success. Additionally, student-athletes can be ruled ineligible to play if they demonstrate poor academic performances.

In the extract of the data we will be using, we will compare teams based on their number of student-athletes on the roster (`(Previous)Athletes`), their APR score (`(Previous)Score`), and their ratio of eligible players (`(previous)Eligibility`). We have these information for both the "current" year (2014) and "two" years back (2012).

[(data source)](https://www.kaggle.com/ncaa/academic-scores)

In [ ]:
import pandas as pd
from sqlalchemy import create_engine
db = create_engine('sqlite://', echo=False)
csvfile = 'https://raw.githubusercontent.com/michalis0/Business-Intelligence-and-Analytics/master/data/NCAA.csv'
df = pd.read_csv(csvfile, delimiter=';')
table_name = 'ncaa'
df.to_sql(table_name, con=db)

Now, let's take a first look at the data we will be working with.

In [ ]:
query = """
select *
from ncaa
limit 5
"""
sql_df = pd.read_sql(query, con=db)
sql_df

   index                      School  ... PreviousScore PreviousEligibility
0      0     Northwestern University  ...         979.0              0.9583
1      1        University of Oregon  ...         952.0              1.0000
2      2           Dartmouth College  ...        1000.0              1.0000
3      3  Texas Christian University  ...         918.0              0.8800
4      4    University of Louisville  ...        1000.0              1.0000

[5 rows x 10 columns]

Each row contains a team. We can see that the dataset contains the following information:
- **`School`:** Name of the university affiliated to the team.
- **`Sport`:** Name of the sport (and gender) the team plays.
- **`Conference`:** Conference the team is playing in.
- **`Athletes`:** Number of athletes currently on the team (2014).
- **`Score`:**  Current Academic Progress Rate (APR) of the team (2014).
- **``Eligibility:``** Ratio of players currently eligible to play (2014).
- **`PreviousAthletes`:** Number of athletes previously on the team (2012).
- **`PreviousScore`:**  Previous Academic Progress Rate (APR) of the team (2012).
- **``PreviousEligibility:``** Ratio of players previously eligible to play (2012).

### Question 1
Find all the schools whose name contains a `W` and have an ice-hockey team.

Hint: To account for both women and men's teams, use `'%Ice Hockey'`.

In [ ]:
query = """
select School
from ncaa
where Sport like "%Ice Hockey" and School like "%W%"
"""
sql_df = pd.read_sql(query, con=db)
sql_df

                                 School
0  University of Minnesota, Twin Cities
1      University of Wisconsin, Madison
2                      Brown University
3      University of Wisconsin, Madison
4  University of Minnesota, Twin Cities
5                      Brown University

### Question 2
Select the worst team that received the worst `Score`, as well as that `Score`.

Hint: You need to select the `School`, the `Sport`, and the `Score` as `WorstScore`.

In [ ]:
query = """
select School, Sport, min(Score) as 'WorstScore'
from ncaa
"""
sql_df = pd.read_sql(query, con=db)
sql_df

                       School           Sport  WorstScore
0  University of South Dakota  Women's Tennis         875

### Question 3
Find the three schools whose athletes have the worst `Score` on average.

Hint: Use `order by` and `limit`.

In [ ]:
query = """
select *
from ncaa
group by School
order by avg(Score) asc
limit 3
"""
sql_df = pd.read_sql(query, con=db)
sql_df

   index                           School  ... PreviousScore PreviousEligibility
0    296       University of South Dakota  ...         969.0              0.9375
1    355  Georgia Institute of Technology  ...        1000.0              1.0000
2    313          Oregon State University  ...        1000.0              0.9556

[3 rows x 10 columns]

### Questions 4
Find the three conferences with the most schools in them. Display both the name of the conferences and the respective number of schools they contain (as `NumberOfSchools`).

Hint: You need to count the amount of distinct schools in each conference.

In [ ]:
query = """
select Sport, count(School) as 'NumberOfSchools'
from ncaa
group by Sport
order by NumberOfSchools desc
limit 3
"""
sql_df = pd.read_sql(query, con=db)
sql_df

                Sport  NumberOfSchools
0    Men's Basketball               68
1  Women's Basketball               68
2      Women's Soccer               66

### Question 5
How many `PreviousAthletes` that played in teams where every athlete was eligible (`PreviousEligibility = 1`) did each schools of the `The Ivy League` conference have? Additionally, display the numbers you find as `TotalPreviousAthletes`

Hint: Select the name of the schools and the sum of `PreviousAthletes`.

In [ ]:
query = """
select School, sum(PreviousAthletes) as 'PreviousAthletes'
from ncaa
where (Conference = 'The Ivy League') and (PreviousEligibility == 1)
"""
sql_df = pd.read_sql(query, con=db)
sql_df

                       School  PreviousAthletes
0  University of Pennsylvania             967.0

### Question 6
Find the three sports that currently have the smartest athletes. For a sport to be considered, it needs to have at least 555 athletes.

Hint: Select the sport and the average score of its teams and use a having clause.

In [ ]:
query = """
select Sport, sum(Athletes), round(avg(Score),3) as "Average Score"
from ncaa
group by Sport
having sum(Athletes) >= 555
order by avg(Score) desc
limit 3
"""
sql_df = pd.read_sql(query, con=db)
sql_df

                Sport  sum(Athletes)  Average Score
0      Women's Soccer           1575        989.182
1      Women's Tennis            575        988.424
2  Women's Basketball            944        985.794

### Question 7
Find the average points by which each school, all sports combined, improved their `Score` compared to `PreviousScore`. Additionally, round that average to 2 decimals, call it `AverageScoreImprovement` and order the results by that average.

Hint: You need to group the observations by `School` and take the average of ` (Score - PreviousScore)`.

In [ ]:
query = """
select School, round(avg(Score-PreviousScore),2) as 'AverageScoreImprovement'
from ncaa
group by School
"""
sql_df = pd.read_sql(query, con=db)
sql_df

                         School  AverageScoreImprovement
0      Arizona State University                    17.00
1             Baylor University                    -2.20
2                Boston College                    12.70
3              Brown University                     1.56
4            Clemson University                    29.83
..                          ...                      ...
63       Wake Forest University                    18.00
64  Washington State University                   -16.75
65     West Virginia University                    15.80
66  Western Illinois University                     1.00
67              Yale University                    -0.88

[68 rows x 2 columns]

### Question 8
Rank the men's spoyrts according to their `PastPopularit`, which is the total amount of `Athletes` that played a sport.

Hint: To select only men's sports you can use `'M%'` with a `like` in a `where` clause.

In [ ]:
query = """
select Sport, sum(Athletes) as 'PastPopularit'
from ncaa
where Sport like 'M%'
group by Sport
order by sum(Athletes) desc
"""
sql_df = pd.read_sql(query, con=db)
sql_df

              Sport  PastPopularit
0  Men's Basketball            929
1      Men's Soccer            853
2      Men's Tennis            513
3  Men's Ice Hockey            385
4      Men's Skiing             65

### Question 9
Find how many athletes each of the 5 women's sports have gained (or lost).

Hint: To select only women's sports you can use `'W%'` with a `like` in a `where` clause.

In [ ]:
query = """
select Sport, sum(Athletes - PreviousAthletes) as 'Athlete difference'
from ncaa
where Sport like 'W%'
group by Sport
"""
sql_df = pd.read_sql(query, con=db)
sql_df

                Sport  Athlete difference
0  Women's Basketball                25.0
1  Women's Ice Hockey               -15.0
2      Women's Skiing                -3.0
3      Women's Soccer                38.0
4      Women's Tennis                11.0

### Question 10
There are some schools that have adopted new sports between the last survey and the present one. Find out which schools adopted which new sports.

Hint: If a school did not offer a sport, its `PreviousAthletes`, `PreviousScore`, and `PreviousEligibility` are missing. If a school is offering a spoort, its `Athletes`, `Score`, and `Eligibility` are not missing. Use `Null`

In [ ]:
query = """
select School, Sport
from ncaa
where (PreviousAthletes is null and PreviousScore is null and PreviousEligibility is null) and (Athletes is not null and Score is not null and Eligibility is not null)
"""
sql_df = pd.read_sql(query, con=db)
sql_df

                          School               Sport
0  Pennsylvania State University    Men's Ice Hockey
1  Pennsylvania State University  Women's Ice Hockey
2    Western Illinois University      Women's Tennis